Revit 2027 API
IExportContext.IsCanceled Method
 This method is queried at the beginning of every element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
bool IsCanceled()
Function IsCanceled As Boolean
bool IsCanceled()
abstract IsCanceled : unit -> bool
Return Value
Boolean
 Return True if you wish to cancel the exporting process, or False otherwise.
See Also
Reference
IExportContext Interface
Autodesk.Revit.DB Namespace